In [1]:
import pandas as pd
a=pd.Series([4,6,-5,3], index=['x1','x2','y1','y2'])
print(a)

x1    4
x2    6
y1   -5
y2    3
dtype: int64

In [4]:
a['x1']

4

In [6]:
a[['x2','y2']]

x2    6
y2    3
dtype: int64

In [7]:
a/a.sum()

x1    0.500
x2    0.750
y1   -0.625
y2    0.375
dtype: float64

In [13]:
a=pd.Series([4,6,-5,None], index=['x1','x2','y1','y2'])
print(a)
missing_val = pd. isnull(a)
print(missing_val)

x1    4.0
x2    6.0
y1   -5.0
y2    NaN
dtype: float64
x1    False
x2    False
y1    False
y2     True
dtype: bool

In [ ]:
'''Normalizing data'''

In [18]:
import pandas as pd
df=pd.DataFrame({"Data1":[10,20,30], "Data2":[40,50,60]})
norm_df= (df-df.min())/(df.max()-df.min())
print(norm_df)

   Data1  Data2
0    0.0    0.0
1    0.5    0.5
2    1.0    1.0

In [19]:
df=pd.read_csv('https://archive.ics.uci.edu/ml/machine-learning-databases/adult/adult.data', header=None, usecols=[0])
norm_df= (df-df.min())/(df.max()-df.min())
print(norm_df)

              0
0      0.301370
1      0.452055
2      0.287671
3      0.493151
4      0.150685
...         ...
32556  0.136986
32557  0.315068
32558  0.561644
32559  0.068493
32560  0.479452

[32561 rows x 1 columns]

In [26]:
import pandas as pd
data={
    'name': ['Mahendar', 'Thejaswani', 'Mallesham', 'Renuka','Mahendar', 'Thejaswani', 'Mallesham', 'Renuka'],
    'age': [25,24,45,40,25,24,45,40],
    'gender': [False, True, False, True,False, True, False, True]
        }
pd.DataFrame(data)

         name  age  gender
0    Mahendar   25   False
1  Thejaswani   24    True
2   Mallesham   45   False
3      Renuka   40    True
4    Mahendar   25   False
5  Thejaswani   24    True
6   Mallesham   45   False
7      Renuka   40    True

In [27]:
df=pd.DataFrame(data)
print(df.index)

RangeIndex(start=0, stop=8, step=1)

In [29]:
print(df.index.values)

[0 1 2 3 4 5 6 7]

In [30]:
print(df.index.values.tolist())

[0, 1, 2, 3, 4, 5, 6, 7]

In [31]:
df=pd.DataFrame(data)
df.index=['M','T','M','R','M','T','M','R']
df

         name  age  gender
M    Mahendar   25   False
T  Thejaswani   24    True
M   Mallesham   45   False
R      Renuka   40    True
M    Mahendar   25   False
T  Thejaswani   24    True
M   Mallesham   45   False
R      Renuka   40    True

In [81]:
import pandas as pd
data={
    'name': ['mahendar', 'thejaswani', 'pallesham', 'senuka'],
    'age': [25,24,45,40],
    'gender': [False, True, False, True]
        }
a=pd.DataFrame(data, index=[m','t','p','s'])
a.loc['m':'t']

SyntaxError: invalid syntax (2432276457.py, line 7)

In [75]:
data={
    'name': ['Mahendar', 'Thejaswani', 'Mallesham', 'Renuka'],
    'age': [25,24,45,40],
    'gender': [False, True, False, True]
        }
pd.DataFrame(data)

         name  age  gender
0    Mahendar   25   False
1  Thejaswani   24    True
2   Mallesham   45   False
3      Renuka   40    True

In [77]:
df=pd.DataFrame(data, index=['m','t','m','r'])
df.drop('name', axis=1)

   age  gender
m   25   False
t   24    True
m   45   False
r   40    True

In [79]:
df.drop(['m','t'])

     name  age  gender
r  Renuka   40    True

In [82]:
df=pd.DataFrame({'f1':[1,2,2,1], 'f2':[0,1,1,1]})
df.drop_duplicates()

   f1  f2
0   1   0
1   2   1
3   1   1

In [83]:
df=pd.DataFrame(data, index=['m','t','m','r'])
df[df.gender==False]

        name  age  gender
m   Mahendar   25   False
m  Mallesham   45   False

In [84]:
df+df

                   name  age  gender
m      MahendarMahendar   50   False
t  ThejaswaniThejaswani   48    True
m    MalleshamMallesham   90   False
r          RenukaRenuka   80    True

In [89]:
df+df+df+df+df

                                                name  age  gender
m           MahendarMahendarMahendarMahendarMahendar  125   False
t  ThejaswaniThejaswaniThejaswaniThejaswaniThejas...  120    True
m      MalleshamMalleshamMalleshamMalleshamMallesham  225   False
r                     RenukaRenukaRenukaRenukaRenuka  200    True

In [90]:
df=pd.DataFrame(data)
df['gender']=df['gender'].apply(lambda x: not x)
print(df['gender'])

0     True
1    False
2     True
3    False
Name: gender, dtype: bool

In [ ]:
'''Labda Functions'''

In [91]:
x=lambda a: a+10
print(x(5))

15

In [92]:
x=lambda a: a*10
print(x(5))

50

In [93]:
x=lambda a: a/10
print(x(10000))

1000.0

In [133]:
data={
    'name': ['Mahendar', 'Thejaswani', 'Mallesham', 'Renuka'],
    'age': [25,24,45,40],
    'gender': [False, True, False, True]
     }
print(pd.DataFrame(data))
df=pd.DataFrame(data)
df.sort_index(axis=1)

         name  age  gender
0    Mahendar   25   False
1  Thejaswani   24    True
2   Mallesham   45   False
3      Renuka   40    True

   age  gender        name
0   25   False    Mahendar
1   24    True  Thejaswani
2   45   False   Mallesham
3   40    True      Renuka

In [140]:
df.sort_index(ascending=False)

         name  age  gender
3      Renuka   40    True
2   Mallesham   45   False
1  Thejaswani   24    True
0    Mahendar   25   False

In [149]:
df.sort_values(by= ['age'])

         name  age  gender
1  Thejaswani   24    True
0    Mahendar   25   False
3      Renuka   40    True
2   Mallesham   45   False

In [ ]:
'''Statistics'''

In [150]:
df.describe()

             age
count   4.000000
mean   33.500000
std    10.598742
min    24.000000
25%    24.750000
50%    32.500000
75%    41.250000
max    45.000000

In [155]:
print(pd.DataFrame(data))
df['gender'].value_counts()

         name  age  gender
0    Mahendar   25   False
1  Thejaswani   24    True
2   Mallesham   45   False
3      Renuka   40    True

False    2
True     2
Name: gender, dtype: int64

In [ ]:
'''Filling missing values'''

In [174]:
import numpy as np
import pandas as pd
df=pd.DataFrame([[np.nan,2,np.nan,0],[3,4,np.nan,1],[np.nan,np.nan,np.nan,5],[np.nan,3,np.nan,4]], columns=list('ABCD'))
print(df)
df.fillna(0)

     A    B   C  D
0  NaN  2.0 NaN  0
1  3.0  4.0 NaN  1
2  NaN  NaN NaN  5
3  NaN  3.0 NaN  4

     A    B    C  D
0  0.0  2.0  0.0  0
1  3.0  4.0  0.0  1
2  0.0  0.0  0.0  5
3  0.0  3.0  0.0  4